{
  "name": "Charna Parkey",
  "slug": "charna-parkey",
  "bio": "Dr. Charna is VP of Product and Strategy for AI Agents at DataStax an IBM Company. \n\nShe is an experienced serial startup tech executive, product builder, engineer, speaker, writer, mentor and coach, leveraging 20+ years of experience to successfully bring several B2B AI/ML products to market. She has worked with more than 90% of the Fortune 100, to implement AI products at scale. \n\nAt Kaskada, a product lead startup, she co-created the first commercially available feature engine with time travel. A system for real-time feature engineering, raising the level of abstractions that allow you instantly generate training datasets from historical data and get production instantly. Co-author and inventor on several patents, including patent-pending work on ML/coordinated feature engine at the edge.\n\nLeadership experience: Founder of disciplines, most recently Product and Data Science, previously 4 disciplines, leading 3 of those simultaneously: Applied Science; Customer Success Engineering, Account Management, and Support. Extensive experience communicating the mission and vision to hire, coach, and promote a team of 19 directly. Deep experience in mentoring and growing leadership in Engineering and coaching first-time Executives in many disciplines. Track record of interviewing at all levels, including C-level executives cross-functionally.\n\nManagement experience: Experienced manager of managers, budgets, and change management in high-growth environments. Contributed to every hiring process to scale the team from 6 to 100 across all disciplines, at which point the engineering org was mature enough to conduct its own IC interviews. After, I contributed to hiring processes for managers and executives cross-functionally, scaling from 100-150.\n\nBusiness experience: Led and was responsible for Partnerships, Go-to-market iterations, and Sales in addition to Product at a 10-person startup. Responsible for running an M&A process, experience contributing to diligence in multiple raise rounds from Series A - C. Directly managed and scaled revenue from pre-revenue to 14.5M in ARR as the VP of Customer Success at Textio.",
  "avatar": "/content/images/people/4c6f74b6c514ca66bc0512a54bf6562a68706711-800x800.jpg",
  "location": "",
  "social": {
    "github": null,
    "linkedin": "https://www.linkedin.com/in/charnaparkey/",
    "twitter": null,
    "website": null
  }
}